Applying:

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # grafana_folder.ElasticSearch will be created
  + resource "grafana_folder" "ElasticSearch" {
      + id    = (known after apply)
      + title = "ElasticSearch"
      + uid   = (known after apply)
      + url   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```